{
  "type": "success",
  "value": [{
    "id": 50,
    "joke": "Chuck Norris invented Kentucky Fried Chicken's famous secret recipe with eleven herbs and spices. Nobody ever mentions the twelfth ingredient: Fear.",
    "categories": []
  }, {
    "id": 463,
    "joke": "Chuck Norris doesn't use web standards as the web will conform to him.",
    "categories": ["nerdy"]
  }, {
    "id": 101,
    "joke": "Archeologists unearthed an old english dictionary dating back to the year 1236. It defined &quot;victim&quot; as &quot;one who has encountered Chuck Norris&quot;",
    "categories": []
  }, {
    "id": 146,
    "joke": "The crossing lights in Chuck Norris's home town say &quot;Die slowly&quot; and &quot;die quickly&quot;. They each have a picture of Chuck Norris punching or kicking a pedestrian.",
    "categories": []
  }, {
    "id": 551,
    "joke": "Chuck Norris can over-write a locked variable.",
    "categories": ["nerdy"]
  }, {
    "id": 509,
    "joke": "Chuck Norris's OSI network model has only one layer - Physical.",
    "categories": ["nerdy"]
  }, {
    "id": 97,
    "joke": "Chuck Norris doesn't throw up if he drinks too much. Chuck Norris throws down!",
    "categories": []
  }, {
    "id": 305,
    "joke": "Chuck Norris knows everything there is to know - Except for the definition of mercy.",
    "categories": []
  }, {
    "id": 92,
    "joke": "Chuck Norris invented black. In fact, he invented the entire spectrum of visible light. Except pink. Tom Cruise invented pink.",
    "categories": []
  }, {
    "id": 469,
    "joke": "Chuck Norris can unit test entire applications with a single assert.",
    "categories": ["nerdy"]
  }, {
    "id": 494,
    "joke": "Chuck Norris breaks RSA 128-bit encrypted codes in milliseconds.",
    "categories": ["nerdy"]
  }, {
    "id": 45,
    "joke": "What was going through the minds of all of Chuck Norris' victims before they died? His shoe.",
    "categories": []
  }, {
    "id": 246,
    "joke": "Chuck Norris? sperm is so badass, he had sex with Nicole Kidman, and 7 months later she prematurely gave birth to a Ford Excursion.",
    "categories": []
  }, {
    "id": 347,
    "joke": "Some people ask for a Kleenex when they sneeze, Chuck Norris asks for a body bag.",
    "categories": []
  }, {
    "id": 201,
    "joke": "Chuck Norris was what Willis was talkin' about.",
    "categories": []
  }, {
    "id": 508,
    "joke": "Chuck Norris doesn't need an OS.",
    "categories": ["nerdy"]
  }, {
    "id": 399,
    "joke": "In the movie &quot;The Matrix&quot;, Chuck Norris is the Matrix. If you pay close attention in the green &quot;falling code&quot; scenes, you can make out the faint texture of his beard.",
    "categories": []
  }, {
    "id": 431,
    "joke": "Rules of fighting: 1) Don't bring a knife to a gun fight. 2) Don't bring a gun to a Chuck Norris fight.",
    "categories": []
  }, {
    "id": 538,
    "joke": "Chuck Norris's log statements are always at the FATAL level.",
    "categories": ["nerdy"]
  }, {
    "id": 324,
    "joke": "Chuck Norris drinks napalm to quell his heartburn.",
    "categories": []
  }]
}